Revit 2027 API
FabricationPart.Slope Property
 The slope for the straight fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Slope { get; }
Public ReadOnly Property Slope As Double
	Get
public:
property double Slope {
	double get ();
}
member Slope : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace